# Stairs Path Type Start Symbol Type Id Property

Source: https://www.revitapidocs.com/2026/9d3eb283-4348-8330-99f9-6440074e7aaf.htm

---

| Stairs Path Type Start Symbol Type Id Property |
| --- |

The start symbol type of stairs path.
**Namespace:** Autodesk.Revit.DB.Architecture
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId StartSymbolTypeId { get; set; }
```

```
Public Property StartSymbolTypeId As ElementId
	Get
	Set
```

```
public:
property ElementId^ StartSymbolTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member StartSymbolTypeId : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The startSymbolTypeId is not a valid start symbol or arrowhead type. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

StairsPathType Class Autodesk.Revit.DB.Architecture Namespace